app/Controllers/Bendahara.php

SELECT *
FROM `profil_kop`
WHERE `profil_kop`.`id` = 1
SELECT *
FROM `petugas`
WHERE `petugas`.`id_petugas` = 'PT009'
SELECT *
FROM `pinjaman`
SELECT *
FROM `simpanan`
SELECT *
FROM `anggota`
---
    public function index()
    {
        $notif_count = $this->notifikasiModel->countnotifikasiBylevelBen();
        $notifikasi = $this->notifikasiModel->notifikasiBylevelBen();
        $profilkop = $this->profilKopM->find(1);
        $data = [
            'profilkop' => $profilkop,
            'title' => $profilkop['nama_kop']." | Dashboard",
            'judul' => '',
            'menu' => 'dashboard',
            'menu2' => '',
            'submenu' => '',
            'header' => 'layout/header',
            'sidemenu' => 'layout/sidemenu',
            'page' => 'index',
            'footer' => 'layout/footer',
            'dtpetugas' => $this->petugasModel->find(session('id_petugas')),
            'jumlahAnggotaAktif' => $this->anggotaModel->jmlAnggotaAktif(),
            'jumlahAnggota' => $this->anggotaModel->jmlAnggota(),
            'jumlahPinjaman' => $this->pinjamanModel->findAll(),
            'jumlahPinjaman' => $this->pinjamanModel->jumlahPinjaman(),
            'jumlahPinjamanPj' => $this->pinjamanModel->jumlahPinjamanByPanjang(),
            'jumlahPinjamanPd' => $this->pinjamanModel->jumlahPinjamanByPendek(),
            'jumlahPinjamanBkd' => $this->pinjamanModel->jumlahPinjamanByBkd(),
            'pinjamanPj' => $this->jenisPinjaman->PinjamanByPanjang(),
            'pinjamanPd' => $this->jenisPinjaman->PinjamanByPendek(),
            'pinjamanBkd' => $this->jenisPinjaman->PinjamanByBkd(),
            'jumlahSimpanan' => $this->simpanModel->findAll(),
            'jumlahKas' => $this->kasModel->findAll(),
            'jumlahPengajuan' => $this->pengajuanModel->jumlahPengajuan(),
            'jumlahPengajuanDitolak' => $this->pengajuanModel->jumlahPengajuanDitolak(),
            'anggota' => $this->anggotaModel->findAll(),

SELECT *
FROM `profil_kop`
WHERE `profil_kop`.`id` = 1
---
    public function dataSimpanan()
    {
        $notif_count = $this->notifikasiModel->countnotifikasiBylevelBen();
        $notifikasi = $this->notifikasiModel->notifikasiBylevelBen();
        $simpanNonAktif = $this->simpanModel->getSimpananAnggotaNonAktif();
        $simpan = $this->simpanModel->getSimpananAnggota();
        $profilkop = $this->profilKopM->find(1);