app/Controllers/Kas.php

    public function kasDebet()
    {
        $notif_count = $this->notifikasiModel->countnotifikasiBylevelKetu();
        $notifikasi = $this->notifikasiModel->notifikasiBylevelKetu();
        $profilkop = $this->profilKopM->find(1);
        $data = [
            'profilkop' => $profilkop,
            'title' => $profilkop['nama_kop']." | Kas Debet Koperasi",
            'judul'     => '',
            'menu'      => 'kas',
            'menu2' => '',
            'submenu'   => 'kas-debet',
            'header'    => 'layout/header',
            'sidemenu'  => 'layout/sidemenu',
            'footer'    => 'layout/footer',
            'page'      => 'kas/kas_debit',
            'uraiann'   => $this->kasuraianModel->findAll(),
---
SELECT *
FROM `profil_kop`
WHERE `profil_kop`.`id` = 1
SELECT *
FROM `kas_uraian`