app/Controllers/Petugas.php

    public function laporanPinjaman()
    {
        $notif_count = $this->notifikasiModel->countnotifikasiBylevelKetu();
        $notifikasi = $this->notifikasiModel->notifikasiBylevelKetu();
        $profilkop = $this->profilKopM->find(1);
---
SELECT *
FROM `profil_kop`
WHERE `profil_kop`.`id` = 1