app/Controllers/Sekretaris.php

SELECT *
FROM `profil_kop`
WHERE `profil_kop`.`id` = 1
---
    public function daftarTagihan()
    {
        $notifikasi = $this->notifikasiModel->notifikasiBylevelSek();
        $notif_count = $this->notifikasiModel->countNotifikasiBylevelSek();
        $allNotifikasi = $this->notifikasiModel->allNotifikasiByLevelSek();
        $profilkop = $this->profilKopM->find(1);