app/Models/NotifikasiModel.php

    public function notifikasiByLevelSek()
    {
        // $query = $this->db->query("SELECT * FROM notifikasi where level_c = '1' and is_read = 0 ORDER by created_at DESC");
        // return $query->getResultArray();
        return $this->db->table('notifikasi')
        ->join('notif_referensi', 'notif_referensi.id_referensi = notifikasi.id_referensi')
        ->where('level_c',1)->where('is_read',0)
        ->orderBy('notifikasi.created_at DESC')
        ->get()->getResultArray();
---
SELECT *
FROM `notifikasi`
JOIN `notif_referensi` ON `notif_referensi`.`id_referensi` = `notifikasi`.`id_referensi`
WHERE `level_c` = 1
AND `is_read` = 0
ORDER BY `notifikasi`.`created_at` DESC

    public function notifikasiByLevelBen()
    {
        // $query = $this->db->query("SELECT * FROM notifikasi where level_b = '1' and is_read = 0 ORDER by created_at DESC");
        // return $query->getResultArray();
        return $this->db->table('notifikasi')
        ->join('notif_referensi', 'notif_referensi.id_referensi = notifikasi.id_referensi')
        ->where('level_b',1)->where('is_read',0)
        ->orderBy('notifikasi.created_at DESC')
        ->get()->getResultArray();
---
SELECT *
FROM `notifikasi`
JOIN `notif_referensi` ON `notif_referensi`.`id_referensi` = `notifikasi`.`id_referensi`
WHERE `level_b` = 1
AND `is_read` = 0
ORDER BY `notifikasi`.`created_at` DESC

    public function notifikasiByLevelKetu()
    {
        // $query = $this->db->query("SELECT * FROM notifikasi where level = '1' and is_read = 0 ORDER by created_at DESC");
        // return $query->getResultArray();
        return $this->db->table('notifikasi')
        ->join('notif_referensi', 'notif_referensi.id_referensi = notifikasi.id_referensi')
        ->where('level',1)->where('is_read',0)
        ->orderBy('notifikasi.created_at DESC')
        ->get()->getResultArray();
---
SELECT *
FROM `notifikasi`
JOIN `notif_referensi` ON `notif_referensi`.`id_referensi` = `notifikasi`.`id_referensi`
WHERE `level` = 1
AND `is_read` = 0
ORDER BY `notifikasi`.`created_at` DESC