app/Models/PengajuanModel.php

    public function jumlahPengajuan()
    {
        return $this->db->table('pengajuan_pinjaman')->where('status_pengajuan', 'Diterima')->get()->getResultArray();
---
SELECT *
FROM `pengajuan_pinjaman`
WHERE `status_pengajuan` = 'Diterima'

    public function jumlahPengajuanDitolak()
    {
        return $this->db->table('pengajuan_pinjaman')->where('status_pengajuan', 'Ditolak')->get()->getResultArray();
---
SELECT *
FROM `pengajuan_pinjaman`
WHERE `status_pengajuan` = 'Ditolak'