app/Models/PinjamanModel.php

SELECT *
FROM `pinjaman`
JOIN `pengajuan_pinjaman` ON `pengajuan_pinjaman`.`id_pengajuan` = `pinjaman`.`id_pengajuan`
JOIN `jenis_pinjaman` ON `jenis_pinjaman`.`id` = `pengajuan_pinjaman`.`id_jenis_pinjaman`
JOIN `anggota` ON `pinjaman`.`no_anggota` = `anggota`.`no_anggota`
ORDER BY `pinjaman`.`id_pinjaman` DESC
---
    public function dataPinjamanByIdPinjaman()
    {
        return $this->db->table('pinjaman')
        ->join(
            'pengajuan_pinjaman', 'pengajuan_pinjaman.id_pengajuan = pinjaman.id_pengajuan'
        )->join(
            'jenis_pinjaman', 'jenis_pinjaman.id = pengajuan_pinjaman.id_jenis_pinjaman'
        )->join(
            'anggota', 'pinjaman.no_anggota = anggota.no_anggota'
        )->orderBy('pinjaman.id_pinjaman DESC' )->get()->getResultArray();

SELECT *
FROM `pinjaman`
JOIN `pengajuan_pinjaman` ON `pengajuan_pinjaman`.`id_pengajuan` = `pinjaman`.`id_pengajuan`
---
    public function jumlahPinjaman()
    {
        return $this->db->table('pinjaman')
        ->join(
            'pengajuan_pinjaman', 'pengajuan_pinjaman.id_pengajuan = pinjaman.id_pengajuan'
        )->get()->getResultArray();

SELECT *
FROM `pinjaman`
JOIN `pengajuan_pinjaman` ON `pengajuan_pinjaman`.`id_pengajuan` = `pinjaman`.`id_pengajuan`
WHERE `pengajuan_pinjaman`.`id_jenis_pinjaman` = 2
AND `pengajuan_pinjaman`.`status_pengajuan` = 'Diterima'
---
    public function jumlahPinjamanByPanjang()
    {
        return $this->db->table('pinjaman')
        ->join(
            'pengajuan_pinjaman', 'pengajuan_pinjaman.id_pengajuan = pinjaman.id_pengajuan'
        )->where('pengajuan_pinjaman.id_jenis_pinjaman', 2)
        ->where('pengajuan_pinjaman.status_pengajuan', 'Diterima')->get()->getResultArray();

SELECT *
FROM `pinjaman`
JOIN `pengajuan_pinjaman` ON `pengajuan_pinjaman`.`id_pengajuan` = `pinjaman`.`id_pengajuan`
WHERE `pengajuan_pinjaman`.`id_jenis_pinjaman` = 1
AND `pengajuan_pinjaman`.`status_pengajuan` = 'Diterima'
---
    public function jumlahPinjamanByPendek()
    {
        return $this->db->table('pinjaman')
        ->join(
            'pengajuan_pinjaman', 'pengajuan_pinjaman.id_pengajuan = pinjaman.id_pengajuan'
        )->where('pengajuan_pinjaman.id_jenis_pinjaman', 1)
        ->where('pengajuan_pinjaman.status_pengajuan', 'Diterima')->get()->getResultArray();

SELECT *
FROM `pinjaman`
JOIN `pengajuan_pinjaman` ON `pengajuan_pinjaman`.`id_pengajuan` = `pinjaman`.`id_pengajuan`
WHERE `pengajuan_pinjaman`.`id_jenis_pinjaman` = 3
AND `pengajuan_pinjaman`.`status_pengajuan` = 'Diterima'
---
    public function jumlahPinjamanByBkd()
    {
        return $this->db->table('pinjaman')
        ->join(
            'pengajuan_pinjaman', 'pengajuan_pinjaman.id_pengajuan = pinjaman.id_pengajuan'
        )->where('pengajuan_pinjaman.id_jenis_pinjaman', 3)
        ->where('pengajuan_pinjaman.status_pengajuan', 'Diterima')->get()->getResultArray();