app/Models/SimpanModel.php

    public function lapTagihanWajib($bln,$thn)
    {
        return $this->db->table('simpanan_detail')
        ->join('anggota', 'anggota.no_anggota = simpanan_detail.no_anggota')
        ->join('jenis_simpanan', 'jenis_simpanan.id = simpanan_detail.id_jenis_simpanan')
        ->where('simpanan_detail.id_jenis_simpanan',2)
        ->where('simpanan_detail.id_jenis_simpanan',3)
        ->where('anggota.status_anggota',1)
        ->where('MONTH(simpanan_detail.tanggal)',$bln)
        ->where('YEAR(simpanan_detail.tanggal)',$thn)
        ->get()->getResultArray();
---
SELECT *
FROM `simpanan_detail`
JOIN `anggota` ON `anggota`.`no_anggota` = `simpanan_detail`.`no_anggota`
JOIN `jenis_simpanan` ON `jenis_simpanan`.`id` = `simpanan_detail`.`id_jenis_simpanan`
WHERE `simpanan_detail`.`id_jenis_simpanan` = 2
AND `simpanan_detail`.`id_jenis_simpanan` = 3
AND `anggota`.`status_anggota` = 1
AND MONTH(simpanan_detail.tanggal) = '9'
AND YEAR(simpanan_detail.tanggal) = '2023'

    public function lapTagihanSukarela($bln,$thn)
    {
        return $this->db->table('simpanan_detail')
        ->join('anggota', 'anggota.no_anggota = simpanan_detail.no_anggota')
        ->join('jenis_simpanan', 'jenis_simpanan.id = simpanan_detail.id_jenis_simpanan')
        ->where('anggota.status_anggota',1)
        ->where('jenis_simpanan.id',3)
        ->where('simpanan_detail.sts_setor', 'Otomatis')
        ->where('MONTH(simpanan_detail.tanggal)',$bln)
        ->where('YEAR(simpanan_detail.tanggal)',$thn)
        ->groupBy('anggota.no_anggota')
        ->get()->getResultArray();
---
SELECT *
FROM `simpanan_detail`
JOIN `anggota` ON `anggota`.`no_anggota` = `simpanan_detail`.`no_anggota`
JOIN `jenis_simpanan` ON `jenis_simpanan`.`id` = `simpanan_detail`.`id_jenis_simpanan`
WHERE `anggota`.`status_anggota` = 1
AND `jenis_simpanan`.`id` = 3
AND `simpanan_detail`.`sts_setor` = 'Otomatis'
AND MONTH(simpanan_detail.tanggal) = '9'
AND YEAR(simpanan_detail.tanggal) = '2023'
GROUP BY `anggota`.`no_anggota`